        IDENTIFICATION  DIVISION.
        PROGRAM-ID.     cobmain.
        PROCEDURE       DIVISION.
                call "subr1"
                call "subr2"
                call "subr3"
                STOP RUN.
                